test_app/app/controllers/books_controller.rb

  def delete_confirmation
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["author", "me"], ["price", "10.0"], ["published_date", "2023-08-28 22:12:00"], ["created_at", "2023-09-06 03:12:19.447252"], ["updated_at", "2023-09-06 03:12:19.447252"]]